In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'], 'key2':['one', 'two', 'one', 'two', 'one'],'data1':np.random.randn(5), 'data2':np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one  2.250213 -0.088659
1    a  two -0.338868 -0.306332
2    b  one -1.478914 -0.008615
3    b  two  0.534411 -0.496366
4    a  one -0.360873 -0.218673

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [9]:
grouped.mean()

key1
a    0.516824
b   -0.472252
Name: data1, dtype: float64

In [12]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [13]:
means

key1  key2
a     one     0.944670
      two    -0.338868
b     one    -1.478914
      two     0.534411
Name: data1, dtype: float64

states = np.array()

In [20]:
states = np.array(['Ohio', 'California','California', 'Ohio', 'Ohio'])

In [24]:
years=np.array([2005, 2005,2006, 2005, 2006])

In [25]:
df['data1']

0    2.250213
1   -0.338868
2   -1.478914
3    0.534411
4   -0.360873
Name: data1, dtype: float64

In [26]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.338868
            2006   -1.478914
Ohio        2005    1.392312
            2006   -0.360873
Name: data1, dtype: float64

In [28]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.944670 -0.153666
     two  -0.338868 -0.306332
b    one  -1.478914 -0.008615
     two   0.534411 -0.496366

In [29]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64